adapters/deutsche-bank-adapter/src/test/resources/pis/payments/sepa-credit-transfers/initiate-payment-redirect.json

{
  "request": {
    "headers": {
      "X-Request-ID": "e56a3492-e9c7-4357-9b77-0a3bdafdd607",
      "PSU-ID": "6154033403",
      "TPP-Redirect-URI": "http://localhost:8080/redirect",
      "PSU-IP-Address": "0.0.0.0",
      "PSU-ID-Type": "DE_ONLB_DB",
      "Content-Type": "application/json"
    },
    "body": {
      "creditorAccount": {
        "iban": "DE17215730140403340300",
        "currency": "EUR"
      },
      "creditorName": "merchant123",
      "debtorAccount": {
        "iban": "DE25648730420109480400",
        "currency": "EUR"
      },
      "instructedAmount": {
        "amount": "20.99",
        "currency": "EUR"
      },
      "remittanceInformationUnstructured": "just",
      "endToEndIdentification": "SandboxTPPTest1"
    }
  },
  "response": {
    "body": {
      "transactionStatus" : "RCVD",
      "paymentId" : "12a878ec-0d06-40bc-a95c-624cf57b5b65",
      "_links" : {
        "scaStatus" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/12a878ec-0d06-40bc-a95c-624cf57b5b65/authorisations/4fab1281-9aa9-45da-8985-8ea724df685a"
        },
        "scaRedirect" : {
          "href" : "http://localhost:8080/redirect"
        },
        "self" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/12a878ec-0d06-40bc-a95c-624cf57b5b65"
        },
        "status" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/12a878ec-0d06-40bc-a95c-624cf57b5b65/status"
        }
      }
    }
  }
}
