adapters/deutsche-bank-adapter/src/test/resources/pis/payments/sepa-credit-transfers/initiate-payment.json

{
  "request": {
    "headers": {
      "X-Request-ID": "e56a3492-e9c7-4357-9b77-0a3bdafdd607",
      "PSU-ID": "6154033437",
      "TPP-Redirect-URI": "http://localhost:8080/redirect",
      "PSU-IP-Address": "0.0.0.0",
      "PSU-ID-Type": "DE_ONLB_DB",
      "TPP-Redirect-Preferred": "false",
      "Content-Type": "application/json"
    },
    "body": {
      "creditorAccount": {
        "iban": "DE76215730140403343700",
        "currency": "EUR"
      },
      "creditorName": "Anton Bruekner",
      "debtorAccount": {
        "iban": "DE76215730140403343700",
        "currency": "EUR"
      },
      "instructedAmount": {
        "amount": "20.99",
        "currency": "EUR"
      },
      "remittanceInformationUnstructured": "just",
      "endToEndIdentification": "SandboxTPPTest1"
    }
  },
  "response": {
    "body": {
      "transactionStatus" : "RCVD",
      "paymentId" : "de91a99b-5b9d-4f70-8846-81beba089f87",
      "transactionFees" : {
        "currency" : "EUR",
        "amount" : "1.27"
      },
      "transactionFeeIndicator" : true,
      "_links" : {
        "scaStatus" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/de91a99b-5b9d-4f70-8846-81beba089f87/authorisations/43ede576-4b22-4435-ac54-70f2a5eba912"
        },
        "startAuthorisationWithEncryptedPsuAuthentication" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/de91a99b-5b9d-4f70-8846-81beba089f87/authorisations/43ede576-4b22-4435-ac54-70f2a5eba912"
        },
        "self" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/de91a99b-5b9d-4f70-8846-81beba089f87"
        },
        "aspspCertificates" : {
          "href" : "https://simulator-xs2a.db.com/DE/SB-DB/aspsp-certificates/"
        },
        "status" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/payments/sepa-credit-transfers/de91a99b-5b9d-4f70-8846-81beba089f87/status"
        }
      }
    }
  }
}
