adapters/deutsche-bank-adapter/src/test/resources/pis/periodic-payments/sepa-credit-transfers/initiate-payment-redirect.json

{
  "request": {
    "headers": {
      "X-Request-ID": "e56a3492-e9c7-4357-9b77-0a3bdafdd607",
      "PSU-ID": "6154033403",
      "TPP-Redirect-URI": "http://localhost:8080/redirect",
      "PSU-IP-Address": "0.0.0.0",
      "PSU-ID-Type": "DE_ONLB_DB",
      "Content-Type": "application/json"
    },
    "body": {
      "creditorAccount": {
        "iban": "DE17215730140403340300",
        "currency": "EUR"
      },
      "creditorName": "merchant",
      "debtorAccount": {
        "iban": "DE17215730140403340300",
        "currency": "EUR"
      },
      "instructedAmount": {
        "amount": "20.99",
        "currency": "EUR"
      },
      "remittanceInformationUnstructured": "just",
      "endToEndIdentification": "SandboxTPPTest1",
      "startDate": "2021-03-04",
      "endDate": "2021-04-03",
      "executionRule": "following",
      "frequency": "Monthly",
      "dayOfExecution": "28"
    }
  },
  "response": {
    "body": {
      "transactionStatus" : "RCVD",
      "paymentId" : "951a1aef-caf6-4b3a-85e3-3ebcf35c5fc6",
      "transactionFees" : {
        "currency" : "EUR",
        "amount" : "1.27"
      },
      "transactionFeeIndicator" : true,
      "_links" : {
        "scaStatus" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/periodic-payments/sepa-credit-transfers/951a1aef-caf6-4b3a-85e3-3ebcf35c5fc6/authorisations/f6b116b1-66ad-4045-8994-ca5bcd2bcd82"
        },
        "scaRedirect" : {
          "href" : "https://www.deutsche-bank.de/pk/shared/jumppage/sandbox.html?sca-ok=aHR0cHM6Ly9leGFtcGxlLmNvbQ==&sca-nok="
        },
        "self" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/periodic-payments/sepa-credit-transfers/951a1aef-caf6-4b3a-85e3-3ebcf35c5fc6"
        },
        "status" : {
          "href" : "https://simulator-xs2a.db.com/pis/DE/SB-DB/v1/periodic-payments/sepa-credit-transfers/951a1aef-caf6-4b3a-85e3-3ebcf35c5fc6/status"
        }
      }
    }
  }
}
